e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_sf.h
#define SF2_IF_IO_DLY_1_SF2_IO_0_DO_DLY_SEL_SHIFT   (16)
#define SF2_IF_IO_DLY_1_SF2_IO_0_DO_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_1_SF2_IO_0_DO_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_1_SF2_IO_0_DI_DLY_SEL_SHIFT   (8)
#define SF2_IF_IO_DLY_1_SF2_IO_0_DI_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_1_SF2_IO_0_DI_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_1_SF2_IO_0_OE_DLY_SEL_MASK    (0x03)

#define SF2_IF_IO_DLY_2_SF2_IO_1_DO_DLY_SEL_SHIFT   (16)
#define SF2_IF_IO_DLY_2_SF2_IO_1_DO_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_2_SF2_IO_1_DO_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_2_SF2_IO_1_DI_DLY_SEL_SHIFT   (8)
#define SF2_IF_IO_DLY_2_SF2_IO_1_DI_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_2_SF2_IO_1_DI_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_2_SF2_IO_1_OE_DLY_SEL_MASK    (0x03)

#define SF2_IF_IO_DLY_3_SF2_IO_2_DO_DLY_SEL_SHIFT   (16)
#define SF2_IF_IO_DLY_3_SF2_IO_2_DO_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_3_SF2_IO_2_DO_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_3_SF2_IO_2_DI_DLY_SEL_SHIFT   (8)
#define SF2_IF_IO_DLY_3_SF2_IO_2_DI_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_3_SF2_IO_2_DI_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_3_SF2_IO_2_OE_DLY_SEL_MASK    (0x03)

#define SF2_IF_IO_DLY_4_SF2_IO_3_DO_DLY_SEL_SHIFT   (16)
#define SF2_IF_IO_DLY_4_SF2_IO_3_DO_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_4_SF2_IO_3_DO_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_4_SF2_IO_3_DI_DLY_SEL_SHIFT   (8)
#define SF2_IF_IO_DLY_4_SF2_IO_3_DI_DLY_SEL_MASK    (0x03 << SF2_IF_IO_DLY_4_SF2_IO_3_DI_DLY_SEL_SHIFT)
#define SF2_IF_IO_DLY_4_SF2_IO_3_OE_DLY_SEL_MASK    (0x03)

#define SF3_IF_IO_DLY_0_SF3_DQS_DO_DLY_SEL_SHIFT    (30)
#define SF3_IF_IO_DLY_0_SF3_DQS_DO_DLY_SEL_MASK     (0x03 << SF3_IF_IO_DLY_0_SF3_DQS_DO_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_0_SF3_DQS_DI_DLY_SEL_SHIFT    (28)
#define SF3_IF_IO_DLY_0_SF3_DQS_DI_DLY_SEL_MASK     (0x03 << SF3_IF_IO_DLY_0_SF3_DQS_DI_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_0_SF3_DQS_OE_DLY_SEL_SHIFT    (26)
#define SF3_IF_IO_DLY_0_SF3_DQS_OE_DLY_SEL_MASK     (0x03 << SF3_IF_IO_DLY_0_SF3_DQS_OE_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_0_SF3_CLK_OUT_DLY_SEL_SHIFT   (8)
#define SF3_IF_IO_DLY_0_SF3_CLK_OUT_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_0_SF3_CLK_OUT_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_0_SF3_CS_DLY_SEL_MASK         (0x03)

#define SF3_IF_IO_DLY_1_SF3_IO_0_DO_DLY_SEL_SHIFT   (16)
#define SF3_IF_IO_DLY_1_SF3_IO_0_DO_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_1_SF3_IO_0_DO_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_1_SF3_IO_0_DI_DLY_SEL_SHIFT   (8)
#define SF3_IF_IO_DLY_1_SF3_IO_0_DI_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_1_SF3_IO_0_DI_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_1_SF3_IO_0_OE_DLY_SEL_MASK    (0x03)

#define SF3_IF_IO_DLY_2_SF3_IO_1_DO_DLY_SEL_SHIFT   (16)
#define SF3_IF_IO_DLY_2_SF3_IO_1_DO_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_2_SF3_IO_1_DO_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_2_SF3_IO_1_DI_DLY_SEL_SHIFT   (8)
#define SF3_IF_IO_DLY_2_SF3_IO_1_DI_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_2_SF3_IO_1_DI_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_2_SF3_IO_1_OE_DLY_SEL_MASK    (0x03)

#define SF3_IF_IO_DLY_3_SF3_IO_2_DO_DLY_SEL_SHIFT   (16)
#define SF3_IF_IO_DLY_3_SF3_IO_2_DO_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_3_SF3_IO_2_DO_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_3_SF3_IO_2_DI_DLY_SEL_SHIFT   (8)
#define SF3_IF_IO_DLY_3_SF3_IO_2_DI_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_3_SF3_IO_2_DI_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_3_SF3_IO_2_OE_DLY_SEL_MASK    (0x03)

#define SF3_IF_IO_DLY_4_SF3_IO_3_DO_DLY_SEL_SHIFT   (16)
#define SF3_IF_IO_DLY_4_SF3_IO_3_DO_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_4_SF3_IO_3_DO_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_4_SF3_IO_3_DI_DLY_SEL_SHIFT   (8)
#define SF3_IF_IO_DLY_4_SF3_IO_3_DI_DLY_SEL_MASK    (0x03 << SF3_IF_IO_DLY_4_SF3_IO_3_DI_DLY_SEL_SHIFT)
#define SF3_IF_IO_DLY_4_SF3_IO_3_OE_DLY_SEL_MASK    (0x03)

#define SF_2_IF_DQS_EN                         (1 << 5)
#define SF_2_IF_DTR_EN                         (1 << 4)
#define SF_2_IF_PAD_SEL_LOCK                   (1 << 3)
#define SF_2_IF_PAD_SEL_MASK                   (0x03)

#define SF_3_IF_1_ACK_LAT_SHIFT                (29)
#define SF_3_IF_1_ACK_LAT_MASK                 (0x07 << SF_3_IF_1_ACK_LAT_SHIFT)
#define SF_3_SF_CMDS_WRAP_MODE                 (1 << 10)
#define SF_3_SF_CMDS_WRAP_Q_INI                (1 << 9)
#define SF_3_SF_CMDS_BT_EN                     (1 << 8)
#define SF_3_SF_CMDS_BT_DLY_SHIFT              (5)
#define SF_3_SF_CMDS_BT_DLY_MASK               (0x07 << SF_3_SF_CMDS_BT_DLY_SHIFT)
#define SF_3_SF_CMDS_EN                        (1 << 4)
#define SF_3_SF_CMDS_WRAP_LEN_MASK             (0x0f)

#define SF_IF_IAHB_3_IF_2_QPI_MODE_EN          (1 << 31)
#define SF_IF_IAHB_3_IF_2_SPI_MODE_SHIFT       (28)
#define SF_IF_IAHB_3_IF_2_SPI_MODE_MASK        (0x07 << SF_IF_IAHB_3_IF_2_SPI_MODE_SHIFT)
#define SF_IF_IAHB_3_IF_2_CMD_EN               (1 << 27)
#define SF_IF_IAHB_3_IF_2_ADR_EN               (1 << 26)
#define SF_IF_IAHB_3_IF_2_DMY_EN               (1 << 25)
#define SF_IF_IAHB_3_IF_2_DAT_EN               (1 << 24)
#define SF_IF_IAHB_3_IF_2_DAT_RW               (1 << 23)
#define SF_IF_IAHB_3_IF_2_CMD_BYTE_SHIFT       (20)
#define SF_IF_IAHB_3_IF_2_CMD_BYTE_MASK        (0x07 << SF_IF_IAHB_3_IF_2_CMD_BYTE_SHIFT)
#define SF_IF_IAHB_3_IF_2_ADR_BYTE_SHIFT       (17)
#define SF_IF_IAHB_3_IF_2_ADR_BYTE_MASK        (0x07 << SF_IF_IAHB_3_IF_2_ADR_BYTE_SHIFT)
#define SF_IF_IAHB_3_IF_2_DMY_BYTE_SHIFT       (12)
#define SF_IF_IAHB_3_IF_2_DMY_BYTE_MASK        (0x1f << SF_IF_IAHB_3_IF_2_DMY_BYTE_SHIFT)

#define SF_IF_IAHB_6_IF_3_QPI_MODE_EN          (1 << 31)
#define SF_IF_IAHB_6_IF_3_SPI_MODE_SHIFT       (28)
#define SF_IF_IAHB_6_IF_3_SPI_MODE_MASK        (0x07 << SF_IF_IAHB_6_IF_3_SPI_MODE_SHIFT)
#define SF_IF_IAHB_6_IF_3_CMD_BYTE_SHIFT       (20)
#define SF_IF_IAHB_6_IF_3_CMD_BYTE_MASK        (0x07 << SF_IF_IAHB_6_IF_3_CMD_BYTE_SHIFT)

#define SF_PROT_EN_RD_SF_DBG_DIS               (1 << 31)
#define SF_PROT_EN_RD_SF_IF_0_TRIG_WR_LOCK     (1 << 30)
#define SF_PROT_EN_RD_SF_ID1_EN_RD             (1 << 2)
#define SF_PROT_EN_RD_SF_ID0_EN_RD             (1 << 1)
#define SF_PROT_EN_RD                          (1 << 0)

#define SF_PROT_EN_SF_ID1_EN                   (1 << 2)
#define SF_PROT_EN_SF_ID0_EN                   (1 << 1)
#define SF_PROT_EN                             (1 << 0)

#define SF_AES_CFG_R0_SF_AES_REGION_R0_LOCK         (1 << 31)
#define SF_AES_CFG_R0_SF_AES_REGION_R0_EN           (1 << 30)
#define SF_AES_CFG_R0_SF_AES_REGION_R0_HW_KEY_EN    (1 << 29)
#define SF_AES_CFG_R0_SF_AES_REGION_R0_START_SHIFT  (14)
#define SF_AES_CFG_R0_SF_AES_REGION_R0_START_MASK   (0x3fff << SF_AES_CFG_R0_SF_AES_REGION_R0_START_SHIFT)
#define SF_AES_CFG_R0_SF_AES_REGION_R0_END_MASK     (0x3fff)

#define SF_AES_R1_SF_AES_R1_LOCK                    (1 << 31)
#define SF_AES_R1_SF_AES_R1_EN                      (1 << 30)
#define SF_AES_R1_SF_AES_R1_HW_KEY_EN               (1 << 29)
#define SF_AES_R1_SF_AES_R1_START_SHIFT             (14)
#define SF_AES_R1_SF_AES_R1_START_MASK              (0x3fff << SF_AES_R1_SF_AES_R1_START_SHIFT)
#define SF_AES_R1_SF_AES_R1_END_MASK                (0x3fff)

#define SF_AES_R2_SF_AES_R2_LOCK                    (1 << 31)
#define SF_AES_R2_SF_AES_R2_EN                      (1 << 30)
#define SF_AES_R2_SF_AES_R2_HW_KEY_EN               (1 << 29)
#define SF_AES_R2_SF_AES_R2_START_SHIFT             (14)
#define SF_AES_R2_SF_AES_R2_START_MASK              (0x3fff << SF_AES_R2_SF_AES_R2_START_SHIFT)
#define SF_AES_R2_SF_AES_R2_END_MASK                (0x3fff)

#define SF_ID0_OFFSET_MASK                          (0xffffff)

#define SF_ID1_OFFSET_MASK                          (0xffffff)

#endif /* __ARCH_RISCV_SRC_BL702_HARDWARE_BL702_SF_H */
